app/views/pages/search.html.erb

          <label>Distrito</label> <br />
            <%= collection_select(:lang_id, 0, Ubigeo.all, :id, :district) %>
---
SELECT `ubigeos`.* FROM `ubigeos`

          <label>Cerca de: </label> <br />
            <%= collection_select(:lang_id, 0, Nearby.all, :id, :name) %>
---
SELECT `nearbies`.* FROM `nearbies`