app/controllers/pages_controller.rb

  def be_promoted
    @parkinglots = Parkinglot.all
---
SELECT `parkinglots`.* FROM `parkinglots`