app/controllers/parkinglots_controller.rb

SELECT `parkinglots`.* FROM `parkinglots`
---
  def index
    @parkinglots = Parkinglot.all

INSERT INTO `parkinglots` (`name`, `address`, `addressreference`, `pricinghour`, `pricingday`, `businesshours`, `camera`, `security`, `user_id`, `ubigeo_id`, `nearby_id`, `avatar_file_name`, `avatar_content_type`, `avatar_file_size`, `avatar_updated_at`, `created_at`, `updated_at`) VALUES ('Los Portales', 'av miguel  iglesias 456', 'por el hospital maria auxiliadora', 5, 25, '24', 1, 1, 1, 31, 4, 'playa-ANDRES-AVELINO-CACERES.jpg', 'image/jpeg', 175260, '2016-08-09 00:55:58', '2016-08-09 00:55:58', '2016-08-09 00:55:58')
---
  def create
    @parkinglot = Parkinglot.new(parkinglot_params)

    respond_to do |format|
      if @parkinglot.save

UPDATE `parkinglots` SET `name` = 'Los Portales', `address` = 'Av. Felipe Pardo y Aliaga 699', `addressreference` = 'Alt. Cdra. 12 Av. Camino Real', `pricinghour` = 5, `pricingday` = 30, `businesshours` = 'LV - 06:00 - 22:00', `camera` = 1, `security` = 1, `updated_at` = '2016-08-09 04:51:42' WHERE `parkinglots`.`id` = 1
---
  def update
    respond_to do |format|
      if @parkinglot.update(parkinglot_params)

SELECT  `parkinglots`.* FROM `parkinglots` WHERE `parkinglots`.`id` = 1 LIMIT 1
---
    def set_parkinglot
      @parkinglot = Parkinglot.find(params[:id])