app/controllers/profiles_controller.rb

UPDATE `profiles` SET `first_name` = 'Ricardo', `last_name` = 'Blas', `born_at` = '2016-08-09 04:48:00', `updated_at` = '2016-08-09 04:49:05' WHERE `profiles`.`id` = 1
---
  def update
    respond_to do |format|
      if @profile.update(profile_params)

SELECT  `profiles`.* FROM `profiles` WHERE `profiles`.`id` = 1 LIMIT 1
---
    def set_profile
      @profile = Profile.find(params[:id])