app/controllers/reservations_controller.rb

  def index
    @reservations = Reservation.all
---
SELECT `reservations`.* FROM `reservations`

  def create
    @reservation = Reservation.new(reservation_params)

    respond_to do |format|
      if @reservation.save
---
INSERT INTO `reservations` (`byhour`, `byday`, `parkinglot_id`, `user_id`, `datestart`, `timestart`, `dateend`, `timeend`, `created_at`, `updated_at`) VALUES (1, 0, 1, 1, '2016-08-09', '2016-08-09 18:43:00.000000', '2016-08-09', '2016-08-09 18:43:00.000000', '2016-08-09 18:43:52', '2016-08-09 18:43:52')

    def set_reservation
      @reservation = Reservation.find(params[:id])
---
SELECT  `reservations`.* FROM `reservations` WHERE `reservations`.`id` = 1 LIMIT 1