app/controllers/userinteractions_controller.rb

SELECT `userinteractions`.* FROM `userinteractions`
---
  def index
    @userinteractions = Userinteraction.all